"use client";
import styles from "@/components/hiring/hiring.module.css";
import AccordionCard from "@/components/shared/client/accordionCard/AccordionCard";

const data = [
  {
    title : "وظائف محامين متاحة في المجموعة التجارية والبحرية للمحاماة",
    desc : `نفتخر في المجموعة التجارية والبحرية للمحاماة بإتاحة فرص مهنية تشمل وظائف خالية للمحامين بالشركات, لمَن يتملّكُه حب البحث عن تحديات جديدة وفرص وظائف قانونية مميزة, تقدم كل الدعم للمقبلين على طلبات وظائف المحاماه؛ لتغطية جميع فروع القانون المتنوعة؛ فنحن نهدف إلى إيصال الوعي والإدراك الكامل فيما تقتضيه مهنة المحاماة, وذلك بتقديم التعليم التدريبي والاعتراف بأصحاب المهارات في النمو بتطبيق عدالة القانون في مختَلَف الوظائف القانونية من:
وظائف خالية محامين استئناف: إبتداءً من وظائف محامين استئناف؛ تشكل فرصة التوظيف هذه خيارًا أمثل لكل من يمتاز بامتلاكه مهارات التدقيق والتحليل الفريدة, ومَن يمتلك فكر استراتيجي ذكي في حل القضايا الصعبة. في مجموعتنا نوفر وظائف خالية محامين استئناف, هذه الوظيفة التي تتطلب امتلاك المُتقدِّم عليها قوة الدفاع وتمثيل الموكلين بنجاح أمام المحاكم القضائية. تتمثل قوة الدفاع هذه في التمكّن من عرض الأدلة القوية والبراهين المقنعة لدعم مصلحة الموكل, والتأكيد على صحة القضية وإثبات اتّهام الطرف الآخر.
وظائف خالية محامين ابتدائي: تاليًا وظائف محامين ابتدائي، يعد هذا القسم من وظائف المحاماة, الخطوة الأولى التي يتخذها كل شابٍ مقبلٍ على اقتناص فرصة النمو والتطور والوصول إلى مستويات عليا من إتقان المهارات المهنية, والتعمق في معرفة فروع القانون المختلفة. يتطلب من كل محامي ابتدائي الاستجابة للطلبات الابتدائية منها على سبيل المثال تقديم الاستشارات القانونية بما تسلّح به من معرفة شاملة عن ثنايا القانون.
وظائف خالية محامين جدول عام: بالنسبة لما يخص وظائف محامين جدول عام؛ فهذا النوع من الوظائف القانونية يعد خيارًا أكثر ملاءمةً مع المحامين الذين يتمتعون بانسجام ومرونة قوية في مختلف مجالات القانون. هذه الوظيفة تتطلب من المحامي امتلاك القدرة والموهبة في التعلم السريع والتعامل مع القضايا المعقدة, بما في ذلك القضايا الجنائية وقضايا الأحوال الشخصية بفاعلية ومرونة كبيرة.
وظائف خالية محامين حديث التخرج: أما عن وظائف محامين حديث التخرج، فإنها تمثل فرصة رائعة لتحفيز عمليات التطوير واستخراج الإبداع في تلبية ما تطلبه مهنة المحاماة من واجبات وإجراءات قانونية, يستمدوها من خبراء متمرسين في هذه المهنة؛ حيث يمثلون مدربين لمَن هم حديثي التخرج لاكتساب المهارات وإتقان عرض الخدمات القانونية بجودة تقديم عالية.
وظائف خالية محامين نقض: وأخيرًا وظائف محامين نقض, التي تعد وظيفة من الوظائف القانونية صاحبة الشأن الأكبر في التأثير على مسار العدالة الحق, وإعادة توجيه مسار القضايا ذات أهمية كبرى والسابق الحكم فيها إلى المسار الذي يقتضيه القانون. في مكاتبنا نوفر وظائف خالية محامين نقض خبرة نظرًا لحاجة هذا النوع من وظائف المحاماه إلى امتلاك صاحبها القدرة العالية على الإقناع وتقديم الأدلة والحجج مواجهةً لأكثر القضايا تعقيدًا؛ مما يساعد ذلك على تطوير الطرق القانونية لحل القضايا بالشكل الصحيح وفتح آفاق جديدة للقضايا المستقبلية.`,
  },
  {
    title : "مطلوب محامين خريجين حقوق عربي وإنجليزي",
    desc : `في المجموعة التجارية والبحرية للمحاماة، نوفر وظائف خاليه للمحامين حديثي التخرج من كليات الحقوق العربية والإنجليزية يتمتعون بمعرفة وإدراك عميق حول شتى المجالات القانونية. نحن مكاتب محاماة نطلب محامين متعددي اللغات والثقافات فنحن ندرك أنهما عنصران أساسيان في عالم القانون الحديث, بناءً على ذلك فإننا نسعى لتوفير أكبر عدد من الوظائف القانونية للسمو بتطبيق عدالة القانون على أوسع نطاق ممكن.


خريجين حقوق عربي: في حال كنت خريجًا من إحدى كليات الحقوق العربية وتبحث عن أي من وظائف المحاماه؛ فإن لمهارة إتقانك للغة العربية الفصحى وامتلاك قائمة من المصطلحات القانونية الشائعة بالإضافة إلى إدراكك القوي فيما يخص النظام القانوني العربي؛ سيكون له دور بارز وقوي تقديم كافة الخدمات القانونية لعملائنا من جميع أنحاء مصر والشرق الأوسط, من إعداد وثائق ومستندات قانونية بشكل صحيح وكفاءة عمل عالية لجميع العملاء العرب.

خريجين حقوق انجليزي: إذا كنت خريجًا من إحدى كليات الحقوق الإنجليزية وتبحث عن وظيفة من الوظائف القانونية؛ ففي طبيعة الحال ستكون متقنًا للغة الإنجليزية ومطلع على المصطلحات القانونية, وتمتعك بفهم عميق حول النظام القانوني الدولي. تعد اللغة الإنجليزية سبيل التواصل القانوني العالمي ولغة الأعمال الدولية في جميع أنحاء العالم, بناءً على ذلك فإنك سوف تمثل الفائدة الكبرى في التعامل والتواصل بفعالية مع عملائنا في قضايا التجارة الدولية والقانون الدولي.

خريجين الجامعة الأمريكية: يختلف خريجين الجامعة الأمريكية عن خريجي الحقوق الإنجليزية في, أنّ الأول حصل على فرص التعليم القانونية بصورة أكثر شمولية بالتركيز على مبادئ النظام القانوني الدولي, بالإضافة إلى امتلاكك المعرفة العميقة فيما يخص القوانين المصرية المعمول بها. من خلال وظائف المحاماه هذه ستتمكن من الاستجابة لطلبات الاستشارة القانونية والتعامل مع العملاء بصورة فاعلية.

ضمن مكاتب المجموعة التجارية والبحرية للمحاماة والاستشارات القانونية, لا نكتفي فقط بتوفير وظائف خاليه للمحامين, بل نحرص ايضاً على توفير بيئة تطوير فعّالة وبيئة عمل لتحفيز ممارسة المهنة. في مكاتبنا نحن نهتم بتقدير المعرفة والإدراك العميق لمجالات القانون المختلفة والاطلاع على مواد وبنود القانون المصري المعمول به؛ فنحن نقرّ بسعينا إلى التطور الدائم والسريع وتقديم كافة طرق الخدمات القانونية لعملائنا وموكلينا في الشرق الأوسط؛ لذا إن كنت تبحث عن اياً من وظائف المحامين وترغب في الإنضمام إلى فريق عملنا المتخصص, فإننا نتطلع إلى التعرف على مؤهلاتك المقدمة والاستماع إلى رؤيتك في إمكانيتك على المساهمة الفعلية, لذا قم بالتقديم الآن على الوظائف القانونية الخاصة بنا وكن من فريق عملنا وشاركنا في تطبيق عدالة القانون في مجال المحاماة.
`
  }
]

const Accordion = () => {
  return (
    <section className="accordionQuestions">
      <h2>نظرة حول وظائف خالية للمحامين في TCMG</h2>
      {data.map((el,index) => (
        <AccordionCard title={el.title} desc={el.desc} key={index} />
      ))}
    </section>
  );
};

export default Accordion;
