import styles from "./page.module.css"
const HomeWhyUs = () => {
  return (
    <section className={styles.whyUs}>
    <h2>لماذا تختارنا وبكل ثقة؟</h2>
    <p>
      يمتاز مكتبنا عن غيره من مكاتب المحاماة المعتمدة الأخرى في الأخلاقيات
      التي تسيّر آلية العمل داخل مكتبنا، بالإضافة إلى مبادئ المحامين والشركاء
      العاملين في المكتب والمؤمنين بأهمية تطوير الذات على المستوى العملي
      والقانوني سعيًا منهم لتحويل مكتبنا لشركة محاماة دولية في مصر. فقد شهد
      عملاؤنا بقوة مكتبنا وثقة التعامل معنا، والمبادئ التالية ما ستجدها عند
      التعامل معنا:
    </p>
    <div className="slider"></div>
  </section>
  )
}

export default HomeWhyUs
